WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/hcom/hcom_common.h
/****************************************************************************
 * configs/stm32f777-zit6-meadow/src/hcom/hcom_common.h
 * 
 *   Copyright (C) 2019 Wilderness Labs. All rights reserved.
 *   Copyright (C) 2017 Gregory Nutt. All rights reserved.
 *   Copyright (C) 2017 Alan Carvalho de Assis. All rights reserved.
 *   Author:  Wilderness Labs
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/
#ifndef __CONFIGS_MEADOW_SRC_MEADOW_HOSTCOM__H
#define __CONFIGS_MEADOW_SRC_MEADOW_HOSTCOM__H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/compiler.h>
#include <fcntl.h>
#include <sys/types.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#ifndef __ASSEMBLY__
#include <stdint.h>
#endif
#include <stdbool.h>
#include <pthread.h>
#include <signal.h>
#include <time.h>
#include <crc32.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/board.h>
#include <nuttx/mm/mm.h>
#include <nuttx/config.h>
#include <limits.h>

#include <nuttx/arch.h>
#include <nuttx/mtd/mtd.h>
#include <nuttx/userspace.h>
#include <nuttx/kthread.h>

#include "chip/stm32f76xx77xx_memorymap.h"
#include "chip/stm32_rtcc.h"    // battery backed registers and ram

#include "hcom_mono_main.h"

#ifndef OK
  #define OK 0
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

// Update the following for each release build
#define HCOM_DEVICE_INFO_PRODUCT "Meadow by Wilderness Labs"
#define HCOM_DEVICE_INFO_MODEL "F7Micro"
#define HCOM_DEVICE_INFO_MEADOW_OS_VERSION "0.1.2"
#define HCOM_DEVICE_INFO_PROCESSOR_TYPE "STM32F777IIK6"
#define HCOM_DEVICE_INFO_COPROCESSOR_TYPE "ESP32"
#define HCOM_DEVICE_INFO_COPROCESSOR_OS_VERSION "0.0.1"
#define HCOM_DEVICE_INFO_MONO_VERSION "0.0.0.1"

#define HCOM_PROTOCOL_CURRENT_VERSION_NUMBER (0x0003)

//---------------------------------------------------------------------
// The code not compiled by this #define could be removed
#define HCOM_DISABLE_LOW_LEVEL_FILE_SYSTEM_COMMANDS

#define HCOM_COMMUNICATIONS_DEVICE_NAME "/dev/ttyACM0"

#define HCOM_FLASH_FILE_PARTITION_COUNT_MAX 8

#ifdef CONFIG_MTD_PARTITION
#define HCOM_NUMBER_OF_FS_PARTITIONS 2    // Any number 2 - 8
#else
#define HCOM_NUMBER_OF_FS_PARTITIONS 1    // 1 if no partitions in use
#endif

// "/meadow" is shared by all supported file systems
#define HCOM_FILE_MOUNT_POINT_TARGET "/meadow"
#ifdef CONFIG_FS_SMARTFS
#define HCOM_MIN_EXPECTED_CONFIG_SMARTFS_MAXNAMLEN 32
#define HCOM_FILE_MOUNT_FILE_SYS_TYPE "smartfs"
#define HCOM_FILE_MOUNT_POINT_SOURCE "/dev/smart" // assumes partitioning
#endif

#ifdef CONFIG_FS_LITTLEFS
#define HCOM_FILE_MOUNT_FILE_SYS_TYPE "littlefs"
#define HCOM_FILE_MOUNT_POINT_SOURCE "/dev/little"
#define HCOM_FILE_MOUNT_FORCE_FORMAT "forceformat"
#endif

// These define how long the host receive thread waits before "waiking up"
#define HCOM_RECV_TIMEOUT_DEFAULT 1 * 60 * 5 //DEBUGGING * 60    // once an hour
#define HCOM_RECV_TIMEOUT_ACTIVE 5           // seconds

#define HCOM_CONNECTION_TIMEOUT_STARTUP 50 * 1000   // At startup we connect quickly
#define HCOM_CONNECTION_TIMEOUT_RUNNING 5000 * 1000 // If no host connection at first wait longer
// How many fast connection attempts during startup before falling to a slower rate
#define HCOM_CONNECTION_STARTUP_ATTEMPTS (1000000 / HCOM_CONNECTION_TIMEOUT_STARTUP) * 5 // 5 seconds

// This defines the largest packet of data to be sent/received
#define HCOM_PACKET_MAX_SIZE 512
#define HCOM_CIR_BUFFER_MAX_PACKETS 4   // Not used except here
// Based on the encoding scheme (COTS), after encoding there will usually be 2-3 bytes added. One that
// prepends the message and the delimiter of '0'. For messages longer than 254 bytes, another byte may
// be added every 254 bytes.
#define HCOM_SAFE_PACKET_BUF_SIZE (HCOM_PACKET_MAX_SIZE + 4 + (HCOM_PACKET_MAX_SIZE / 254))
#define HCOM_CIRCULAR_BUF_MEM_SIZE (HCOM_SAFE_PACKET_BUF_SIZE * HCOM_CIR_BUFFER_MAX_PACKETS)

// Host text message buffer sizes for text messages 
#define HCOM_SHORT_HOST_STRING_BUFF_LENGTH 128                  // automatic variable
#define HCOM_MAX_HOST_STRING_BUFF_LENGTH 2048                   // allocate
// PATH_MAX is defined by Nuttx in limits.h. It's 256 or less
#define HCOM_MAX_PATH_AND_FILE_BUFF_LENGTH ((PATH_MAX * 2) + 2) // allocate

// Circular buffer return values
enum hcom_recv_buffer_return
{
  HCOM_CIR_BUF_INIT_OK,
  HCOM_CIR_BUF_INIT_FAILED,

  HCOM_CIR_BUF_ADD_SUCCESS,
  HCOM_CIR_BUF_ADD_WONT_FIT,
  HCOM_CIR_BUF_ADD_BAD_ARG,

  HCOM_CIR_BUF_GET_FOUND_MSG,
  HCOM_CIR_BUF_GET_NONE_FOUND,
  HCOM_CIR_BUF_GET_DEST_NO_ROOM
};

// This enum defines the current processing activity for a data packet
// the protocol COULD be modified so that each data packet contains
// this information. This would allow more than one operation to be
// processed at the same time.
// To do this the protocol would need to be enhanced so that command carried
// an additional field to identify the "series" a particular data packet
// belonged to. For each command a unique series number would exist and the 
// the sequence numbers 1-n would be unique for each series.
enum hcom_current_recv_action
{
  CurrentHcomDataPacketActionNone,
  CurrentHcomDataPacketActionExtFileXfer // Could be expanded to specify file type (e.g. mscorlib.dll)
};

//----------------------------------------------------------------
// Trace level constants
#define HCOM_TRACE_LEVEL_DEFAULT 0
#define HCOM_TRACE_LEVEL_NOTICE 1
#define HCOM_TRACE_LEVEL_NOTICE_INFO 2
#define HCOM_TRACE_LEVEL_NOTICE_INFO_DEBUG 3

//--------------------------------------------------------------------
// Redefine Battery Backed Registers so we know what's what
#define HCOM_BATTERY_BACKED_REG_SYSLOG_MASK   STM32_RTC_BK31R
#define HCOM_BATTERY_BACKED_REG_MONO_ACCESS   STM32_RTC_BK30R
#define HCOM_BATTERY_BACKED_REG_MONO_ACTION   STM32_RTC_BK29R
#define HCOM_BATTERY_BACKED_REG_BIT_FLAGS     STM32_RTC_BK28R

#define HCOM_BBREG_RESTART_ENDED_BIT_FLAG 0x00000001
#define HCOM_BBREG_DIAG_MSG_TO_HOST_BIT_FLAG 0x00000002

//--------------------------------------------------------------------
// Protocol support
#define HCOM_PROTOCOL_PACKET_TERMINATING_VALUE (0x00)
#define HCOM_PROTOCOL_PACKET_TERMINATING_STRING ("\0")

#define HCOM_PROTOCOL_REQUEST_HEADER_SEQ_NUMBER 0

// This are the offsets to the header elements
#define HCOM_PROTOCOL_REQUEST_HEADER_SEQ_OFFSET 0
#define HCOM_PROTOCOL_REQUEST_HEADER_VERSION_OFFSET 2
#define HCOM_PROTOCOL_REQUEST_HEADER_CONTROL_OFFSET 4
#define HCOM_PROTOCOL_REQUEST_HEADER_RQST_TYPE_OFFSET 6
#define HCOM_PROTOCOL_REQUEST_HEADER_USER_DATA_OFFSET 8
#define HCOM_PROTOCOL_REQUEST_HEADER_LENGTH 12

#define HCOM_PROTOCOL_REQUEST_MAX_STRING_LEN (HCOM_PACKET_MAX_SIZE - HCOM_PROTOCOL_REQUEST_HEADER_LENGTH)

// Unique to FILE header type
#define HCOM_PROTOCOL_REQUEST_HEADER_FILE_SIZE_OFFSET 0
#define HCOM_PROTOCOL_REQUEST_HEADER_FILE_CHKSM_OFFSET 4
#define HCOM_PROTOCOL_REQUEST_HEADER_FILE_NAME_OFFSET 8

// The following are the hcom protocol message types
// The upper 8-bits are used to determine the header type
#define HCOM_PROTOCOL_HEADER_TYPE_MASK 0xff00

  enum HcomProtocolHeaderTypes
  {
    HCOM_PROTOCOL_HEADER_TYPE_UNDEFINED = 0x0000,

    // Simple request types, include 4-byte user data. The User data field
    // is type dependent
    HCOM_PROTOCOL_HEADER_TYPE_SIMPLE = 0x0100,

    // File related types includes 4-byte user data (used for the destination
    // partition id), 4-byte file size, 4-byte checksum and variable length
    // destination file name.
    HCOM_PROTOCOL_HEADER_TYPE_FILE = 0x0200,

    // Simple text. The text will fit in the header extension
    HCOM_PROTOCOL_HEADER_TYPE_SIMPLE_TEXT = 0x0300,

    // Long text, longer than will fit in the header.
    // User data is used for total message length, followed by the variable
    // length document title.
    // [Future - may need to define encoding e.g. Unicode, ascii UTF-8, multi-byte...]
    //HCOM_PROTOCOL_HEADER_TYPE_LONG_TEXT = 0x0400,
  };

  // Messages sent from host to Meadow 
  enum HcomMeadowRequestType
  {
    HCOM_MDOW_REQUEST_UNDEFINED_REQUEST       = 0x00 | HCOM_PROTOCOL_HEADER_TYPE_UNDEFINED,

    HCOM_MDOW_REQUEST_CREATE_ENTIRE_FLASH_FS  = 0x01 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_CHANGE_TRACE_LEVEL      = 0x02 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_FORMAT_FLASH_FILE_SYS   = 0x03 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_END_FILE_TRANSFER       = 0x04 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_RESET_PRIMARY_MCU       = 0x05 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_VERIFY_ERASED_FLASH     = 0x06 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_PARTITION_FLASH_FS      = 0x07 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_MOUNT_FLASH_FS          = 0x08 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_INITIALIZE_FLASH_FS     = 0x09 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_BULK_FLASH_ERASE        = 0x0a | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_ENTER_DFU_MODE          = 0x0b | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_ENABLE_DISABLE_NSH      = 0x0c | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_LIST_PARTITION_FILES    = 0x0d | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_LIST_PART_FILES_AND_CRC = 0x0e | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_MONO_DISABLE            = 0x0f | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_MONO_ENABLE             = 0x10 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_MONO_RUN_STATE          = 0x11 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_GET_DEVICE_INFORMATION  = 0x12 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_DIAG_TO_SYSLOG          = 0x13 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_DIAG_TO_HOST            = 0x14 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,

    // Only used for testing
    HCOM_MDOW_REQUEST_DEVELOPER_1             = 0xf0 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_DEVELOPER_2             = 0xf1 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_DEVELOPER_3             = 0xf2 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_DEVELOPER_4             = 0xf3 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    // Testing QSPI flash
    HCOM_MDOW_REQUEST_S25FL_QSPI_INIT         = 0xf4 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_S25FL_QSPI_WRITE        = 0xf5 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_S25FL_QSPI_READ         = 0xf6 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,

    HCOM_MDOW_REQUEST_START_FILE_TRANSFER     = 0x01 | HCOM_PROTOCOL_HEADER_TYPE_FILE,
    HCOM_MDOW_REQUEST_DELETE_FILE_BY_NAME     = 0x02 | HCOM_PROTOCOL_HEADER_TYPE_FILE,
  };

  // Messages sent meadow to host
  enum HcomHostRequestType
  {
    HCOM_HOST_REQUEST_UNDEFINED_REQUEST       = 0x00 | HCOM_PROTOCOL_HEADER_TYPE_UNDEFINED,

    // Simple types
    HCOM_HOST_REQUEST_SIMPLE_MESSAGE          = 0x01 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,    // Just the header
    HCOM_HOST_REQUEST_SIMPLE_TEXT_MESSAGE     = 0x01 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE_TEXT, // Header with text (500 bytes max)
  };

  // This enumeration can and must be used with HCOM_HOST_REQUEST_SIMPLE_MESSAGE and
  // HCOM_HOST_REQUEST_SIMPLE_TEXT_MESSAGE. 
  enum HcomProtocolCtrl
  {
    HcomProtoCtrlRequestUndefined,
    HcomProtoCtrlRequestRejected,
    HcomProtoCtrlRequestAccepted,
    HcomProtoCtrlRequestEnded,
    HcomProtoCtrlRequestError,
    HcomProtoCtrlRequestInformation,
    HcomProtoCtrlRequestFileListHeader,
    HcomProtoCtrlRequestFileListMember,
    HcomProtoCtrlRequestMonoMessage,
    HcomProtoCtrlRequestDeviceInfo,
    HcomProtoCtrlRequestDeviceDiag,
  };

  struct HcomProtocolHeader_s
  {
    uint16_t seqNumber;
    uint16_t version;
    uint16_t control;
    uint16_t rqstType;
    uint32_t userData;
  } __attribute__((packed));


  struct host_com_cir_buffer_s
  {
    uint8_t *bottom; // bottom of buffer
    uint8_t *top;    // top end of buffer
    uint8_t *head;   // add data here
    uint8_t *tail;   // remove from here
  };

#ifndef __ASSEMBLY__

#ifdef __cplusplus
#define EXTERN extern "C"
extern "C"
{
#else
#define EXTERN extern
#endif

  /****************************************************************************************************
 * Public Functions
 ****************************************************************************************************/

  // Startup Manager
  int hcom_manager_setup(FAR struct mtd_dev_s *mtd);
#if defined(CONFIG_STM32F7_PWR)
  int hcom_manager_syslog_mask_init(void);
#endif

  // USB CDC/ACM host interface
  int hcom_usb_acm_setup(void);
  void hcom_usb_acm_shutdown(void);
  int hcom_usb_acm_open_wait_for_usb(void);
  int hcom_usb_acm_recv_thread_loop(void);
  int hcom_usb_acm_transmit_to_host(FAR const uint8_t xmitBuffer[], size_t xmitLength);

  // Host message builder
  int hcom_host_msg_builder_setup(void);
  void hcom_host_msg_builder_shutdown(void);
  int hcom_host_msg_bldr_send_information_msg(uint16_t ctrlData, uint32_t userData);
  int hcom_host_msg_bldr_send_short_text_msg(uint16_t ctrlData, uint32_t userData, char *shortText);

  // Save and Parse request
  int hcom_save_parse_request_setup(void);
  void hcom_save_parse_request_shutdown(void);
  int hcom_recv_process_raw_data(uint8_t recvBuff[], const ssize_t recvByteCnt);

  // Execute Request for downloaded file
  int hcom_exec_rqst_download_file_rqst_setup(void);
  bool hcom_exec_rqst_download_is_download_active(void);
  void hcom_exec_rqst_download_file_rqst_start(const uint8_t *recvPacketData,
      const size_t recvPacketDataSize,uint32_t partitionId);
  void hcom_exec_rqst_download_file_rqst_end(uint32_t user_data);
  void hcom_exec_rqst_download_data_packet(const uint8_t *packet, const size_t packetSize, uint16_t seqNumb);

  // Execute Flash file system related request
  int hcom_exec_flash_fs_setup(FAR struct mtd_dev_s *mtd);
  void hcom_exec_flash_fs_delete(const uint8_t *recvPacketData, const size_t recvPacketDataSize, uint32_t user_data);
  void hcom_exec_flash_fs_format(uint32_t partitionId);
  void hcom_exec_flash_fs_partition(uint32_t numbOfPartitions);
  void hcom_exec_flash_fs_mount(uint32_t user_data);
  void hcom_exec_flash_fs_initialize(uint32_t partitionId);
  void hcom_exec_flash_fs_create(uint32_t userData);
  void hcom_exec_flash_fs_return_file_list(uint32_t partitionId);
  void hcom_exec_flash_fs_return_file_list_with_crc(uint32_t partitionId);

  // Execute Utility Request
  int hcom_exec_rqst_misc_setup(FAR struct mtd_dev_s *mtd);
  void hcom_exec_flash_fs_flash_bulk_erase(uint32_t user_data);
  void hcom_exec_flash_fs_flash_verify_erase(uint32_t user_data);
  void hcom_exec_rqst_misc_mcu_restart(uint32_t user_data);
  void hcom_exec_rqst_misc_enter_dfu_mode(uint32_t user_data);
  void hcom_exec_rqst_misc_change_trace_level(uint32_t userData);
  void hcom_exec_rqst_misc_enable_disable_nsh(uint32_t userData);
  void hcom_exec_rqst_misc_route_diag_to_syslog(uint32_t userData);
  void hcom_exec_rqst_misc_route_diag_to_host(uint32_t userData);

  void hcom_bbreg_write(uint32_t regNumber, uint32_t value);
  uint32_t hcom_bbreg_read(uint32_t regNumber);
  bool hcom_bbreg_bit_test_and_clear(uint32_t regNumber, uint32_t value);
  void hcom_bbreg_bit_set(uint32_t regNumber, uint32_t value);
  bool hcom_bbreg_bit_test(uint32_t regNumber, uint32_t value);
  void hcom_bbreg_bit_clear(uint32_t regNumber, uint32_t value);

  void hcom_exec_rqst_misc_mono_disable(uint32_t userData);
  void hcom_exec_rqst_misc_mono_enable(uint32_t userData);
  void hcom_exec_rqst_misc_mono_run_state(uint32_t userData);
  void hcom_exec_rqst_misc_get_device_info(uint32_t userData);

  // File commands
  int hcom_file_commands_setup(void);
  void hcom_file_commands_shutdown(void);
  bool hcom_file_commands_is_active_file(void);
  int hcom_file_commands_open_active_file(const uint32_t partitionId, const char *mountPoint, const char *fileName);
  int hcom_file_commands_write_to_active_file(const uint8_t *fileWriteData, const size_t fileWriteSize);
  int hcom_file_commands_close_active_file(void);
  uint32_t hcom_file_commands_calc_crc_for_file(char *completeFilePath);
  int hcom_file_commands_delete_by_name(const uint32_t partitionId, const char *mountPoint, const char *fileName);

  // File system helper
  int hcom_fs_helper_setup(FAR struct mtd_dev_s *mtd);
  int hcom_fs_helper_init_file_system(void);
  void hcom_fs_helper_shutdown(void);
  int hcom_fs_helper_create_partition_initialize_and_mount_fs(FAR struct mtd_dev_s *master_flash_mtd, uint32_t numbOfPartitions);
  int hcom_fs_helper_init_fs_partitions(FAR struct mtd_dev_s *master_flash_mtd, uint32_t partitionCount);
  int hcom_fs_helper_mount_file_system(const char *sourceDevice, const char *targetDevice,
                                          const char *fileSystemType, uint32_t partitionId, const char *mountCommand);
  bool hcom_fs_helper_is_fs_mounted(uint32_t partitionId);
  int hcom_fs_helper_get_list_files_in_partition(uint32_t partitionIdn);
  int hcom_fs_helper_get_list_files_in_partition_and_crc(uint32_t partitionId);
  int hcom_fs_helper_fs_initialize_proxy(uint32_t partitionId);
  int hcom_fs_helper_format_fs_proxy(uint32_t partitionId);

  // Support SmartFS
#ifdef CONFIG_FS_SMARTFS
  int hcom_smartfs_support_setup(void);
  void hcom_smartfs_support_shutdown(void);
  int hcom_smartfs_support_init_part_fs(uint32_t partitionId, struct mtd_dev_s *partMtd);
  int hcom_smartfs_support_mount_format(uint32_t partitionId);
  int hcom_smartfs_support_format(int partitionId);
#endif

  // Support LittleFS
#ifdef CONFIG_FS_LITTLEFS
  int hcom_littlefs_support_setup(void);
  int hcom_little_support_init_master_fs(FAR struct mtd_dev_s *master_flash_mtd);
  void hcom_littlefs_support_shutdown(void);
  #ifdef CONFIG_MTD_PARTITION
  int hcom_littlefs_support_init_part_fs(uint32_t partitionId, struct mtd_dev_s *partMtd);
  #endif
  int hcom_littlefs_support_mount_format(uint32_t partitionId);
#endif

  // Comms support, COBS encode and receive circular buffer
  size_t hcom_com_support_cobs_encoder(uint8_t source[], size_t startingOffset, size_t length, uint8_t encoded[]);
  size_t hcom_com_support_cobs_decoder(uint8_t encoded[], size_t length, uint8_t decoded[]);
  int hcom_cirbuf_init(struct host_com_cir_buffer_s *hcom_cbuf, size_t totalCapacity);
  size_t hcom_cirbuf_avail_space(struct host_com_cir_buffer_s *hcom_cbuf);
  int hcom_cirbuf_add_bytes(struct host_com_cir_buffer_s *hcom_cbuf, uint8_t *newBytes, uint32_t bytesToAdd);
  int hcom_cirbuf_get_next_packet(struct host_com_cir_buffer_s *hcom_cbuf, uint8_t *packetBuffer,
                                  size_t packetBufferSize, size_t *packetLength);
  int hcom_cirbuf_release_memory(struct host_com_cir_buffer_s *hcom_cbuf);

  // mono pipe debug message
  int hcom_mono_pipe_setup(void);
  void hcom_mono_pipe_shutdown(void);

  // Common Utils and persistent storage functions
  // todo - function names need work
  int hcom_common_utils_setup(void);
  void hcom_common_utils_shutdown(void);
  void f7syslog(int priority, FAR const IPTR char *fmt, ...);
  void hcom_diag_print_buffer(const uint8_t packetBuffer[], const int bufLen, uint8_t logPriority);
  void hcom_boot_time_mono_check(void);
  bool hcom_is_mono_disabled(void);
  
  // Testing utilities. Mostly Flash testing
  int hcom_exec_rqst_testing_setup(FAR struct mtd_dev_s *mtd);
  void hcom_exec_rqst_testing_flash_qspi_init(uint32_t userData);
  void hcom_exec_rqst_testing_flash_qspi_write(uint32_t userData);
  void hcom_exec_rqst_testing_flash_qspi_read(uint32_t userData);
  void hcom_exec_rqst_testing_developer_1(uint32_t userData);
  void hcom_exec_rqst_testing_developer_2(uint32_t userData);
  void hcom_exec_rqst_testing_developer_3(uint32_t userData);
  void hcom_exec_rqst_testing_developer_4(uint32_t userData);

#endif // __ASSEMBLY__

#undef EXTERN
#if defined(__cplusplus)
}
#endif

#endif // __CONFIGS_MEADOW_SRC_MEADOW_HOSTCOM__H